{
    "tables": {
      "overall_data": {
        "description": "Monthly details of revenue, expenses and profit for each well.",
        "columns": {
            "well_name": "Well name",
            "metric_month": "Month for which costs and revenue of each well applies to. It has the value of first day of the month and applies to entire month.",
            "Net_Operating_Profit_to_WI_Owners": "Profit made by the well for the corresponding month in metric_month column value",
            "Oil_Production_Tax": "Oil production tax paid for the well for the corresponding month in metric_month column value",
            "Oil_Sales_Bbls": "Number of barells of oil produced by the well for the corresponding month in metric_month column value",
            "Total_Revenue": "Revenue made by the well for the corresponding month in metric_month column value",
            "Total_WI_Expenses": "Total expenses for the well for the corresponding month in metric_month column value",
            "Workover_Cost": "Workover costs for the well for the corresponding month in metric_month column value",
            "is_forecasted": "Indicates whether the values are forecasted."
        }
      },
      "wells_dca": {
        "description": "Decline curve analysis indicating economic limit of each well.",
        "columns": {
            "well_name": "Well name",
            "initial_production": "Month for which costs and revenue of each well applies to. It has the value of first day of the month and applies to entire month.",
            "decline_rate": "Decline rate found from decline curve analysis using python",
            "dca_method": "Indicates what type of decline curve analysis. possible values are Exponential, Hyperbolic or Harmonic.",
            "already_uneconomic": "Indicates whether the well is already uneconomic. Economic limit for well is 75 barells per month",
            "is_uneconomic_in_2_years": "Indicates whether the well will become uneconomic in 2 years",
            "month_number_if_becoming_uneconomic": "Indicates the number of months from now when will the well become uneconomic"
        }
      },
      "wells_dca_future_predictions": {
        "description": "Forecasted production of each well month wise using decline curve analysis.",
        "columns": {
            "well_name": "Well name",
            "metric_month": "Month for which forecasted production of each well applies to. It has the value of first day of the month and applies to entire month. ",
            "metric_value": "Forecasted production using decline curve analysis"
        }
      },
      "expenses_data": {
        "description": "Monthly detailed expenses breakdown of each well.",
        "columns": {
            "well_name": "Well name",
            "metric_month": "Month for which costs and revenue of each well applies to. It has the value of first day of the month and applies to entire month.",
            "Administrative_Overhead": "Administrative Overhead costs applicable for the well for the month of metric_month column value",
            "Chemical_Solvents": "Chemical Solvents costs applicable for the well for the month of metric_month column value",
            "Computer_Monitoring": "Computer Monitoring costs applicable for the well for the month of metric_month column value",
            "Electricity": "Electricity costs applicable for the well for the month of metric_month column value",
            "Environmental_Expenses": "Environmental Expenses costs applicable for the well for the month of metric_month column value",
            "Field_Direct_Payroll": "Field Direct Payroll costs applicable for the well for the month of metric_month column value",
            "Field_Office_Expense": "Field Office Expense costs applicable for the well for the month of metric_month column value",
            "Fuel_Power": "Fuel Power costs applicable for the well for the month of metric_month column value",
            "Hauling": "Hauling costs applicable for the well for the month of metric_month column value",
            "Land_Expense": "Land Expense costs applicable for the well for the month of metric_month column value",
            "Lease_Crew_Maint": "Lease Crew Maint costs applicable for the well for the month of metric_month column value",
            "Materials_Supplies": "Materials Supplies costs applicable for the well for the month of metric_month column value",
            "Rentals": "Rentals costs applicable for the well for the month of metric_month column value",
            "Repair_Maintenance": "Repair Maintenance costs applicable for the well for the month of metric_month column value",
            "Surface_Payments": "Surface Payments costs applicable for the well for the month of metric_month column value",
            "Total_WI_Expenses": "Total Expenses of the well for the month of metric_month column value",
            "Vacuum_Truck": "Vacuum Truck costs applicable for the well for the month of metric_month column value",
            "Vehicle_Expense": "Vehicle Expense costs applicable for the well for the month of metric_month column value",
            "Workover_Cost": "Workover Cost costs applicable for the well for the month of metric_month column value"
        }
      }
    }
  }
  


  